LogFilesWrk2/Json2VaporClientWrk2V1.txt
Running 2m test @ http://169.254.32.152:8080/jsonShortVapor
  2 threads and 5 connections
  Thread calibration: mean lat.: 1.457ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.441ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.45ms  620.48us   7.26ms   61.63%
    Req/Sec     2.19k   205.78     3.11k    69.20%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.43ms
 75.000%    1.92ms
 90.000%    2.29ms
 99.000%    2.88ms
 99.900%    3.45ms
 99.990%    4.70ms
 99.999%    6.86ms
100.000%    7.27ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.288     0.000000            1         1.00
       0.639     0.100000        45585         1.11
       0.829     0.200000        91369         1.25
       1.047     0.300000       136823         1.43
       1.241     0.400000       182463         1.67
       1.430     0.500000       227931         2.00
       1.527     0.550000       250857         2.22
       1.620     0.600000       273552         2.50
       1.714     0.650000       296406         2.86
       1.813     0.700000       319060         3.33
       1.920     0.750000       341895         4.00
       1.976     0.775000       353353         4.44
       2.034     0.800000       364761         5.00
       2.093     0.825000       376227         5.71
       2.153     0.850000       387677         6.67
       2.215     0.875000       398891         8.00
       2.249     0.887500       404648         8.89
       2.285     0.900000       410490        10.00
       2.321     0.912500       416048        11.43
       2.363     0.925000       421767        13.33
       2.411     0.937500       427496        16.00
       2.439     0.943750       430340        17.78
       2.469     0.950000       433112        20.00
       2.507     0.956250       436003        22.86
       2.551     0.962500       438800        26.67
       2.605     0.968750       441646        32.00
       2.635     0.971875       443019        35.56
       2.669     0.975000       444476        40.00
       2.705     0.978125       445902        45.71
       2.743     0.981250       447307        53.33
       2.785     0.984375       448715        64.00
       2.809     0.985938       449437        71.11
       2.835     0.987500       450144        80.00
       2.865     0.989062       450828        91.43
       2.901     0.990625       451557       106.67
       2.943     0.992188       452244       128.00
       2.969     0.992969       452603       142.22
       2.997     0.993750       452959       160.00
       3.031     0.994531       453317       182.86
       3.071     0.995313       453663       213.33
       3.117     0.996094       454024       256.00
       3.139     0.996484       454204       284.44
       3.167     0.996875       454383       320.00
       3.195     0.997266       454553       365.71
       3.231     0.997656       454729       426.67
       3.279     0.998047       454910       512.00
       3.303     0.998242       455003       568.89
       3.333     0.998437       455090       640.00
       3.365     0.998633       455176       731.43
       3.413     0.998828       455266       853.33
       3.461     0.999023       455357      1024.00
       3.485     0.999121       455398      1137.78
       3.513     0.999219       455443      1280.00
       3.545     0.999316       455486      1462.86
       3.583     0.999414       455532      1706.67
       3.639     0.999512       455575      2048.00
       3.673     0.999561       455598      2275.56
       3.723     0.999609       455619      2560.00
       3.767     0.999658       455642      2925.71
       3.805     0.999707       455665      3413.33
       3.871     0.999756       455686      4096.00
       3.949     0.999780       455698      4551.11
       3.983     0.999805       455708      5120.00
       4.057     0.999829       455720      5851.43
       4.227     0.999854       455732      6826.67
       4.407     0.999878       455742      8192.00
       4.459     0.999890       455747      9102.22
       4.711     0.999902       455753     10240.00
       4.827     0.999915       455759     11702.86
       4.939     0.999927       455764     13653.33
       5.219     0.999939       455770     16384.00
       5.231     0.999945       455772     18204.44
       5.367     0.999951       455775     20480.00
       5.711     0.999957       455778     23405.71
       5.727     0.999963       455781     27306.67
       6.123     0.999969       455784     32768.00
       6.155     0.999973       455785     36408.89
       6.207     0.999976       455786     40960.00
       6.515     0.999979       455788     46811.43
       6.631     0.999982       455789     54613.33
       6.731     0.999985       455791     65536.00
       6.731     0.999986       455791     72817.78
       6.855     0.999988       455792     81920.00
       7.019     0.999989       455793     93622.86
       7.019     0.999991       455793    109226.67
       7.075     0.999992       455795    131072.00
       7.075     0.999993       455795    145635.56
       7.075     0.999994       455795    163840.00
       7.075     0.999995       455795    187245.71
       7.075     0.999995       455795    218453.33
       7.239     0.999996       455796    262144.00
       7.239     0.999997       455796    291271.11
       7.239     0.999997       455796    327680.00
       7.239     0.999997       455796    374491.43
       7.239     0.999998       455796    436906.67
       7.267     0.999998       455797    524288.00
       7.267     1.000000       455797          inf
#[Mean    =        1.455, StdDeviation   =        0.620]
#[Max     =        7.264, Total count    =       455797]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  497267 requests in 2.00m, 77.30MB read
Requests/sec:   4143.89
Transfer/sec:    659.62KB

 >> |2017/09/07 17:16:12|Json2VaporClientWrk2V1|Vapor JSON benchmarking
wrk2 -t2 -d2m -c5 --latency -R4144 --timeout 100s http://169.254.32.152:8080/jsonShortVapor