LogFilesWrk2/JsonPerfectClientWrk2V1.txt
Running 30s test @ http://169.254.162.211:8081/jsonPerfect
  2 threads and 5 connections
  Thread calibration: mean lat.: 5.436ms, rate sampling interval: 14ms
  Thread calibration: mean lat.: 5.422ms, rate sampling interval: 14ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.38ms    1.55ms  24.86ms   84.91%
    Req/Sec   162.28     42.09   384.00     67.86%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    4.98ms
 75.000%    5.68ms
 90.000%    7.15ms
 99.000%   10.98ms
 99.900%   18.17ms
 99.990%   24.86ms
 99.999%   24.88ms
100.000%   24.88ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.219     0.000000            1         1.00
       4.151     0.100000          629         1.11
       4.443     0.200000         1257         1.25
       4.635     0.300000         1888         1.43
       4.795     0.400000         2518         1.67
       4.983     0.500000         3152         2.00
       5.095     0.550000         3453         2.22
       5.211     0.600000         3769         2.50
       5.351     0.650000         4085         2.86
       5.507     0.700000         4405         3.33
       5.683     0.750000         4716         4.00
       5.791     0.775000         4872         4.44
       5.927     0.800000         5025         5.00
       6.095     0.825000         5179         5.71
       6.359     0.850000         5336         6.67
       6.695     0.875000         5493         8.00
       6.911     0.887500         5571         8.89
       7.147     0.900000         5650        10.00
       7.379     0.912500         5729        11.43
       7.679     0.925000         5808        13.33
       7.907     0.937500         5887        16.00
       8.091     0.943750         5925        17.78
       8.263     0.950000         5964        20.00
       8.495     0.956250         6003        22.86
       8.791     0.962500         6042        26.67
       9.071     0.968750         6081        32.00
       9.295     0.971875         6101        35.56
       9.455     0.975000         6121        40.00
       9.631     0.978125         6141        45.71
       9.791     0.981250         6160        53.33
      10.079     0.984375         6179        64.00
      10.303     0.985938         6189        71.11
      10.583     0.987500         6199        80.00
      10.783     0.989062         6209        91.43
      11.031     0.990625         6219       106.67
      11.495     0.992188         6228       128.00
      11.639     0.992969         6233       142.22
      12.063     0.993750         6238       160.00
      12.479     0.994531         6243       182.86
      12.671     0.995313         6248       213.33
      14.751     0.996094         6253       256.00
      14.879     0.996484         6255       284.44
      15.783     0.996875         6258       320.00
      16.167     0.997266         6260       365.71
      16.991     0.997656         6263       426.67
      17.359     0.998047         6265       512.00
      17.375     0.998242         6266       568.89
      17.583     0.998437         6268       640.00
      17.695     0.998633         6269       731.43
      17.807     0.998828         6270       853.33
      18.175     0.999023         6271      1024.00
      18.639     0.999121         6272      1137.78
      18.671     0.999219         6273      1280.00
      18.671     0.999316         6273      1462.86
      18.863     0.999414         6274      1706.67
      18.863     0.999512         6274      2048.00
      18.991     0.999561         6275      2275.56
      18.991     0.999609         6275      2560.00
      18.991     0.999658         6275      2925.71
      24.863     0.999707         6276      3413.33
      24.863     0.999756         6276      4096.00
      24.863     0.999780         6276      4551.11
      24.863     0.999805         6276      5120.00
      24.863     0.999829         6276      5851.43
      24.879     0.999854         6277      6826.67
      24.879     1.000000         6277          inf
#[Mean    =        5.382, StdDeviation   =        1.547]
#[Max     =       24.864, Total count    =         6277]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  9422 requests in 30.01s, 62.94MB read
Requests/sec:    314.01
Transfer/sec:      2.10MB

 >> |2017/09/06 20:20:53|JsonPerfectClientWrk2V1|Perfect JSON benchmarking / Business case
wrk2 -t2 -d30s -c5 --latency -R315 --timeout 100s http://169.254.162.211:8081/jsonPerfect